# Selecting Rows

### Introduction

Now that we know how to work with a dataframe and select individual columns, it's time for us to see if we can begin to understand our data.

> For example, in our FEMA datasets, are we looking at data from all of the states?  

The answer to these questions will have an impact on how we interpret our results.

### Exploring a DataFrame

So let's get a better sense of the data in our FEMA dataset.  The first thing we'll do is load up the data, and then perhaps look at the columns available.

In [1]:
import pandas as pd
url = "https://raw.githubusercontent.com/jigsawlabs-student/pandas-free-curriculum/master/houston_claims.csv"
claims_df = pd.read_csv(url, index_col = 0)
claims_df[:3]

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,HOUSTON,2017-08-27T00:00:00.000Z,False,X,29.7,-95.5,NaN,195857.43,0.0,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea
1,HOUSTON,2008-09-12T00:00:00.000Z,False,X,29.5,-95.1,NaN,0.00,0.0,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc898dfc
2,HOUSTON,2004-06-29T00:00:00.000Z,False,X,29.8,-95.6,NaN,1420.89,0.0,2004-01-01T00:00:00.000Z,77042,5e398d6774cbd479fc898e4b

In [2]:
claims_df.columns

Index(['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator', 'floodZone',
       'latitude', 'longitude', 'lowestFloodElevation',
       'amountPaidOnBuildingClaim', 'amountPaidOnContentsClaim', 'yearofLoss',
       'reportedZipcode', 'id'],
      dtype='object')

### Viewing a subset of rows

It may be difficult to understand what information is in these columns so perhaps we want to look at some of the initial values, which we can do with the `head` or `tail` methods.

In [5]:
claims_df.head(2)

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,HOUSTON,2017-08-27T00:00:00.000Z,False,X,29.7,-95.5,NaN,195857.43,0.0,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea
1,HOUSTON,2008-09-12T00:00:00.000Z,False,X,29.5,-95.1,NaN,0.00,0.0,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc898dfc

In [6]:
claims_df.tail(2)

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
19998,HOUSTON,2016-04-18T00:00:00.000Z,False,AE,29.9,-95.5,94.0,34746.10,7156.78,2016-01-01T00:00:00.000Z,77040,5e398dac74cbd479fc8e448a
19999,HOUSTON,2017-08-26T00:00:00.000Z,False,X,29.7,-95.3,NaN,28863.65,30000.00,2017-01-01T00:00:00.000Z,77087,5e398dac74cbd479fc8e449b

### Filtering Rows

Ok, now that we know how to select the first and last rows of data, let's see if we can select rows by a certain criteria.  For example, let's start by selecting only the counties in Texas with the zipcode `77096`.

> We can do so with the following.

In [12]:
selected_claims = claims_df[claims_df['reportedZipcode'] == 77096]

In [13]:
selected_claims[:2]

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
117,HOUSTON,2001-06-08T00:00:00.000Z,False,X,29.9,-95.6,NaN,845.09,0.0,2001-01-01T00:00:00.000Z,77040,5e398d6874cbd479fc8997e2
144,HOUSTON,2001-06-08T00:00:00.000Z,False,AE,29.9,-95.6,105.0,94409.03,20300.0,2001-01-01T00:00:00.000Z,77040,5e398d6874cbd479fc899905

The above can be quite confusing, as it's really two steps combined.  Let's break it down. 

* The first step is to select the reportedZipcode column, and repeatedly ask the question, is the zipcode `77096`.

In [15]:
claims_df['reportedZipcode'] == 77096

0         True
1        False
2        False
3        False
4        False
         ...
19995    False
19996    False
19997    False
19998    False
19999    False
Name: reportedZipcode, Length: 20000, dtype: bool

> This returns to us a series of true or false values for each row of data. 

Then, if we pass this series of true or false values into the dataframe, pandas will only return the values for which the value is true, and drop any of the false values.

In [16]:
is_correct_zip = claims_df['reportedZipcode'] == 77096
zip_claims = claims_df[is_correct_zip]

In [17]:
zip_claims[:2]

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,HOUSTON,2017-08-27T00:00:00.000Z,False,X,29.7,-95.5,NaN,195857.43,0.00,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea
10,HOUSTON,2017-08-28T00:00:00.000Z,False,X,29.7,-95.5,NaN,231888.28,65814.56,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898fb4

Let's see this again.  This time selecting those rows where the latitude is 29.5. 

> First we select the `latitude` column and ask if the latitude equals 29.5.

In [18]:
claims_df['latitude'] == 29.5

0        False
1         True
2        False
3        False
4        False
         ...
19995    False
19996    False
19997    False
19998    False
19999    False
Name: latitude, Length: 20000, dtype: bool

Then we can pass this query into our dataframe.

In [20]:
selected_latitude_claims = claims_df[claims_df['latitude'] == 29.5]
selected_latitude_claims[:2]

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
1,HOUSTON,2008-09-12T00:00:00.000Z,False,X,29.5,-95.1,NaN,0.00,0.00,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc898dfc
34,HOUSTON,2008-09-13T00:00:00.000Z,False,X,29.5,-95.1,NaN,121524.32,52966.91,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc899102

So notice that `claims_df` is listed twice.  Once to query if the latitude is `29.5`, and a second time, to select from `claims_df` where the query has a value of True.

```python
claims_df[claims_df['latitude'] == 29.5]
```

### Summary

In this lesson, we learned some basic methods for exploring data.  We saw how to get an overview of the data in an entire dataframe with the `head`, `tail` methods.

Then we moved onto selecting rows that meet a certain criteria, for example, where the latitude is `29.5`.

```python
claims_df[claims_df['latitude'] == 29.5]
```

We saw that it can be helpful to break down queries like the one above into two steps.  

1. Return a series of True or False values for every observation, answering whether the state equals "TEXAS"

In [21]:
claims_df['latitude'] == 29.5

0        False
1         True
2        False
3        False
4        False
         ...
19995    False
19996    False
19997    False
19998    False
19999    False
Name: latitude, Length: 20000, dtype: bool

Then, from the `claims_df` dataframe, select the rows where the value above is `True`.

In [23]:
selected_latitude_claims = claims_df[claims_df['latitude'] == 29.5]
selected_latitude_claims[:3]

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
1,HOUSTON,2008-09-12T00:00:00.000Z,False,X,29.5,-95.1,NaN,0.00,0.00,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc898dfc
34,HOUSTON,2008-09-13T00:00:00.000Z,False,X,29.5,-95.1,NaN,121524.32,52966.91,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc899102
45,HOUSTON,1998-09-11T00:00:00.000Z,True,AE,29.5,-95.1,5.0,0.00,NaN,1998-01-01T00:00:00.000Z,77058,5e398d6874cbd479fc8993cf